TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_СтанцииWarehouse/гкс_СтанцииWarehouse.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_СтанцииWarehouse</name>
  <attributes>
    <name>КодЕСР</name>
    <comment>Код единой сетевой разметки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторWarehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_СтанцииWarehouse/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обновляет данные справочника из Warehouse по идентификатору
//
Процедура ОбновитьДанныеССервера(ИдентификаторWarehouse) Экспорт
	
	РесурсВебСервиса = Справочники.гкс_РесурсыВебСервисов.Stations_GetById;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить(ИмяКлючевогоСвойстваВWarehouse(), ИдентификаторWarehouse);
	
	ПараметрыПреобразованияJSON = Новый Структура;
	ПараметрыПреобразованияJSON.Вставить("ПрочитатьВСоответствие", Ложь);
	ПараметрыПреобразованияJSON.Вставить("ИменаСвойствСоЗначениямиДата", "updatedOn");
	
	ДанныеОтветаВСтруктуре = гкс_ИнтеграцияWarehouse.ВыполнитьЗапросКWarehouse(
		РесурсВебСервиса, ПараметрыЗапроса, ПараметрыПреобразованияJSON);
		
	Ссылка = Справочники.гкс_СтанцииWarehouse.ПустаяСсылка();
	
	// обертка для того чтобы был один алгоритм обработки
	ПолученныеДанные = Новый Массив;
	ПолученныеДанные.Добавить(ДанныеОтветаВСтруктуре);
	гкс_ОбменДаннымиWarehouse.ОбработатьПолученныеДанные(ПолученныеДанные, Ссылка);
			
КонецПроцедуры

Функция СтанцияWarehouseПоИдентификатору(ИдентификаторWarehouse) Экспорт
	
	Результат = ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(ИдентификаторWarehouse) Тогда
		Возврат Результат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтанцииWarehouse.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.гкс_СтанцииWarehouse КАК СтанцииWarehouse
		|ГДЕ
		|	СтанцииWarehouse.ИдентификаторWarehouse = &ИдентификаторWarehouse";
	
	Запрос.УстановитьПараметр("ИдентификаторWarehouse", ИдентификаторWarehouse);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	    ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Попытка
			ОбновитьДанныеССервера(ИдентификаторWarehouse);
		Исключение
			ТекстСообщенияОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
				ИмяСобытияЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,,,
				ТекстСообщенияОбОшибке);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОбОшибке);
		
			Возврат Результат;
		КонецПопытки;
		Результат = СтанцияWarehouseПоИдентификатору(ИдентификаторWarehouse);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции	

#Область КонвертацияПриОбмене

// Возвращает имя ключевого реквизита объекта.
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяКлючевогоСвойства() Экспорт
	
	Возврат "ИдентификаторWarehouse";
	
КонецФункции

// Возвращает имя ключевого поля в Warehouse.
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяКлючевогоСвойстваВWarehouse() Экспорт
	
	Возврат "id";
	
КонецФункции

// Устанавливает соотвествие имен реквизитов объекта 1с и полей ответа от Warehouse 
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица описания конвертации реквизитов:
// 		* СвойствоКонфигурации - Строка
// 		* СвойствоИсточника - Строка
// 		* ИспользуетсяАлгоритмКонвертации - Число 
// 		* ПравилоКонвертацииСвойства - Строка
// 		* ЭтоТабличнаяЧасть - Булево
//
Функция ИнициализацияПравилКонвертацийСвойств() Экспорт
	
	ПравилаКонвертации = гкс_ОбменДаннымиWarehouse.ИнициализацияПравилКонвертацийСвойств();

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, ИмяКлючевогоСвойства(), ИмяКлючевогоСвойстваВWarehouse());
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Наименование",		"name");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "КодЕСР",				"code");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ДатаИзменения",		"updatedOn");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ПометкаУдаления", 	"isDeleted");
	
	Возврат ПравилаКонвертации;
		
КонецФункции

Функция СтанцияКлассификатор(СтанцияWarehouse) Экспорт
	
	Если Не ЗначениеЗаполнено(СтанцияWarehouse) Тогда
		Возврат Справочники.гкс_КлассификаторСтанцийЖД.ПустаяСсылка();
	КонецЕсли;	
	
	Станция = РегистрыСведений.гкс_СоответствиеОбъектовWarehouse.
				СсылкаОбъектаПоСсылкеWarehouse(СтанцияWarehouse);
				
	Если Не ЗначениеЗаполнено(Станция) Тогда
		КодСтанции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтанцияWarehouse, "КодЕСР");
		Если ЗначениеЗаполнено(КодСтанции) Тогда
			Станция = ЖДСтанцияПоКоду(КодСтанции);
			РегистрыСведений.гкс_СоответствиеОбъектовWarehouse.УстановитьСоответствие(СтанцияWarehouse, Станция);
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат Станция;	
	
КонецФункции	

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает локализованное имя события журнала регистрации для интеграции.
//
// Параметры:
//   СобытиеВторогоУровня - Строка - имя события, добавляемое через точку к имени события по умолчанию.
//
// Возвращаемое значение:
//   Строка - Интеграция с Warehouse
//        или Интеграция с Warehouse.<ИмяСобытияВторогоУровня>.
//
Функция ИмяСобытияЖурналаРегистрации(СобытиеВторогоУровня = "")
	
	Если СобытиеВторогоУровня = "" Тогда
		Возврат НСтр("ru = 'Интеграция с Warehouse'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	Иначе
		Возврат СтрШаблон("%1.%2",
			НСтр("ru = 'Интеграция с Warehouse'",
				ОбщегоНазначения.КодОсновногоЯзыка()), СобытиеВторогоУровня);
	КонецЕсли;
	
КонецФункции

// Возвращает ЖД станцию по коду ECP станции
//
// Параметры: 
//   КодСтанции - Строка 
//
// Возвращаемое значение:
//  СправочникСсылка.гкс_КлассификаторСтанцийЖД 
//
Функция ЖДСтанцияПоКоду(КодСтанции) Экспорт
	
	СтанцияЖД = Неопределено;
	Если Не ЗначениеЗаполнено(КодСтанции) Тогда 
		Возврат СтанцияЖД;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	КлассификаторСтанцийЖД.Ссылка КАК СтанцияЖД
		|ИЗ
		|	Справочник.гкс_КлассификаторСтанцийЖД КАК КлассификаторСтанцийЖД
		|ГДЕ
		|	КлассификаторСтанцийЖД.Наименование = &КодСтанции";
	
	Запрос.УстановитьПараметр("КодСтанции", КодСтанции);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СтанцияЖД;	
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Возврат Выборка.СтанцияЖД;
	
КонецФункции

#КонецОбласти

#КонецЕсли
